

text = input("Введите текст :")  # Користувач вводить строку

text = text.lower()  # Програма переводить строку в нижній регістр

print(text.strip('.,-:;?! )'))  # Програма видаляє зі строки такі символи пунктуації: .,-:;?!
print(text.lstrip('.,-:;?! )'))  # # Програма видаляє зайві пробіли\табуляції з лівого кінця строки
print(text.rstrip('.,-:;?!\n\t )'))  # Програма видаляє зайві пробіли\табуляції з правого кінця строки

text1 = input("Какое слово вы хотите заменить?  :")  # Програма питає користувача яке слово
                                                     # (або словосполучення) він бажає замінити

print(f'Индекс слова {text1}', text.rfind(text1))   # Програма повідомляє на якому індексі
                                                    # строки словосполучення присутнє

text2 = input("На какое?  :")  # Програма питає на яке слово треба замінити

print(text.replace(text1, text2))  # Програма виводить відформатовану строку

