
qw1 = """
Привіт 
Хай 
Доброго дня
Здоров
"""

qw2 = """
Як справи?
Що робиш?
Чим займаєшся?
"""

qw3 = """
А я Фільм дивлюсь
А я в Кінотеатрі сиджу
порадь Серіал
А я Мультик дивлюсь
а я в опері
"""


print("Доброго вечора, я бот з України!")

while True:
    user_input = input("Користувач: ")
    if user_input.lower() == '':  # Перевірка на не порожність вводу
        print("Вийди і зайди нормально!!!")

    elif user_input.lower() in qw1.lower():  # Тут реалізував через списки
                                             # (ідея не дуже але більше варіантів на спілкування)
        print("Доброго вечора, я бот з України!")

    elif user_input.lower() in qw2.lower():
        print("Вчусь програмувати на Python!")

    elif user_input.lower() in qw3.lower():
        print("Соррі що втручуюсь, не знаю про що йдеться мова,"
              " але подивіться серіал \"Грiм\", він просто бомба!")

    elif "бувай" in user_input.lower() or "надобраніч" in user_input.lower() \
            or "гудбай" in user_input.lower() or "до зустрічі" in user_input.lower():  # Не поганий варіант, але напевно є цікавіший,
                                                                                       # я його не знайшов поки що
        print("Побачимось у мережі, I'll be back.")
        break
    else:
        print("Дуже цікаво, але, нажаль, нічого не зрозуміло :(")














































