# #
# # 1. Програма отримує на вхід три числа - ширину, висоту та глибину куба,
# # та обчислює об'єм та площу поверхні куба.


x = int(input('Введіть ширину в сантиметрах куба: '))
y = int(input('Введіть висоту в сантиметрах куба: '))
z = int(input('Введіть глибину в сантиметрах куба: '))

v = (x * y * z) / 1000_000
front = x * y
back = y * z
total = (front * 2) + (back * 4)

print()
print(f'Ваш паралелепіпед має {v} метрів кубічних')
print(f'Площа передньої поверхні {front} сантиметрів квадратних')
print(f'Площа бокової поверхні {back} сантиметрів квадратних')
print(f'Загальна площа фігури {total} сантиметрів квадратних')

# # 2.Програма отримує на вхід два числа - вартість товару та відсоток знижки,
# # та обчислює вартість товару з урахуванням знижки.

print('-------------------------------------------------------------------------')

x = float(input('Введіть ціну: '))
y = float(input('Введіть знижку: '))
q = (x / 100) * y
j = x - q
print(f'До сплати {round(j, 2)}грн ваша знижка = {round(q, 2)}грн')

# 3.Програма отримує на вхід рядок, що містить ім'я та прізвище людини,
# та повертає рядок, де ім'я та прізвище розділені комою
# (наприклад, "Іван Іванов" перетворюється на "Іванов, Іван").
#

s = input('Введите Имя и фамилию: ')
z = " "
f = ', '
print(s.replace(z, f))









# 4.Програма отримує на вхід рядок, що містить назву місяця та рік,
# та повертає кількість днів у цьому місяці.
#

# 5.Програма отримує на вхід список чисел та повертає середнє значення цих чисел.
#



# 6.Програма отримує на вхід два числа та перевіряє,
# чи є вони взаємно простими.
#

# 7.Програма отримує на вхід список слів та повертає найбільш повторюване слово в списку.
#
