# Завдання 1

x = int(input('Введіть число x: '))
y = int(input('Введіть число y: '))
if x > y:
    q = x - y
    print(f'{x} більше за {y} на {q}')
elif y > x:
    q = y - x
    print(f'{y} більше за {x} на {q}')
else:
    print(f'{x} та {y} рівні')

print('--------------------------------------------------------------')

# Завдання 2

x = float(input('Введіть число x: '))
y = float(input('Введіть число y: '))

if x < y:
    q = round(x / y, 2)
    print(f'{x} менше за {y} у {q} разів')
elif y < x:
    q = round(y / x, 2)
    print(f'{y} менше за {x} у {q} разів')
else:
    print(f'{x} і {y} рівні')

print('--------------------------------------------------------------')

# Завдання 3

x = int(input('Введіть число x: '))
y = int(input('Введіть число y: '))

q = (y / x) * 100

print(y, ' становить ', round(q, 2), '% від ', x)
