user = input("Введіть строку: ")
low = user.lower()  # перевод в нижній регістр
string = ''.join(e for e in low if e.isalnum())  # видаляє розділові знаки
length = len(string)

for i in range(length // 2):  # перевіряэмо чи є строка паліндромом
    if string[i] != string[length - i - 1]:
        print("Строка не є паліндромом")
        break
else:
    print("Строка є паліндромом")


#------------------------------------------------------------------------------------------------------


# user = input("Введіть строку: ")
#
# # Перетворюємо введену строку в нижній регістр,
# # видаляємо всі пробіли та розділові знаки
#
#
# user = user.lower().replace(" ", "").replace("\t", "")\
#     .replace("\n", "").replace(",", "").replace(".", "")\
#     .replace("!", "").replace("?", "").replace(":", "")\
#     .replace(";", "").replace("-", "").replace("_", "")\
#     .replace("(", "").replace(")", "").replace("[", "")\
#     .replace("]", "").replace("{", "").replace("}", "")
#
# # Перевертаємо строку та порівнюємо з оригінальною
# if user == user[::-1]:
#     print("Ця строка є паліндромом!")
# else:
#     print("Ця строка не є паліндромом!")


#-----------------------------------------------------------------------------------------------------


text = input("Введіть строку: ")
bracket = 0


output = ""
for char in text:  # Проходимо по кожному символу в рядку

    if char == "(":  # Якщо зустріли відкриваючу дужку, збільшуємо лічильник
        bracket += 1

    elif char == ")":  # Якщо зустріли закриваючу дужку, зменшуємо лічильник
        bracket -= 1

    elif bracket == 0:  # Якщо лічильник відкритих дужок дорівнює нулю, то виводимо символ
        output += char

print(output)
